BUILD/doc/source/_static/soap_outputs/6.2.314.3321/create_group_step_9_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>DeleteObject</command>
      <object_list>
        <group>
          <not_flag>0</not_flag>
          <name>All Windows Computers API Test</name>
          <type>0</type>
          <text>Operating System contains "Windows"</text>
          <and_flag>1</and_flag>
          <id>590</id>
          <deleted_flag>0</deleted_flag>
          <filters>
            <filter>
              <substring_length>0</substring_length>
              <not_flag>0</not_flag>
              <all_times_flag>0</all_times_flag>
              <value>.*Windows.*</value>
              <ignore_case_flag>1</ignore_case_flag>
              <max_age_seconds>0</max_age_seconds>
              <value_type>String</value_type>
              <delimiter_index>0</delimiter_index>
              <utf8_flag>0</utf8_flag>
              <operator>RegexMatch</operator>
              <all_values_flag>0</all_values_flag>
              <substring_flag>0</substring_flag>
              <substring_start>0</substring_start>
              <sensor>
                <hash>45421433</hash>
              </sensor>
            </filter>
          </filters>
          <sub_groups></sub_groups>
        </group>
      </object_list>
      <options></options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>